In [2]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}
df=pd.DataFrame(data)

In [3]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [19]:
df2=df.melt(id_vars=["Name"],value_vars=["Math","Science"],var_name="Subject",value_name="Score")

In [20]:
df2

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89

In [25]:
df2.pivot(index="Name",columns=["Subject"],values="Score")

Subject  Math  Science
Name
Alice      85       90
Bob        78       82
Charlie    92       89